
// ADO.cpp : §°§á§â§Ö§Õ§Ö§Ý§ñ§Ö§ä §á§à§Ó§Ö§Õ§Ö§ß§Ú§Ö §Ü§Ý§Ñ§ã§ã§à§Ó §Õ§Ý§ñ §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ.
//

#include "stdafx.h"
#include "ADO.h"
#include "ADODlg.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#endif


// CADOApp

BEGIN_MESSAGE_MAP(CADOApp, CWinApp)
	ON_COMMAND(ID_HELP, &CWinApp::OnHelp)
END_MESSAGE_MAP()


// §ã§à§Ù§Õ§Ñ§ß§Ú§Ö CADOApp

CADOApp::CADOApp()
{
	// §á§à§Õ§Õ§Ö§â§Ø§Ü§Ñ §Õ§Ú§ã§á§Ö§ä§é§Ö§â§Ñ §á§Ö§â§Ö§Ù§Ñ§Ô§â§å§Ù§Ü§Ú
	m_dwRestartManagerSupportFlags = AFX_RESTART_MANAGER_SUPPORT_RESTART;

	// TODO: §Õ§à§Ò§Ñ§Ó§î§ä§Ö §Ü§à§Õ §ã§à§Ù§Õ§Ñ§ß§Ú§ñ,
	// §²§Ñ§Ù§Þ§Ö§ë§Ñ§Ö§ä §Ó§Ö§ã§î §Ó§Ñ§Ø§ß§í§Û §Ü§à§Õ §Ú§ß§Ú§è§Ú§Ñ§Ý§Ú§Ù§Ñ§è§Ú§Ú §Ó InitInstance
}


// §¦§Õ§Ú§ß§ã§ä§Ó§Ö§ß§ß§í§Û §à§Ò§ì§Ö§Ü§ä CADOApp

CADOApp theApp;


// §Ú§ß§Ú§è§Ú§Ñ§Ý§Ú§Ù§Ñ§è§Ú§ñ CADOApp

BOOL CADOApp::InitInstance()
{
	// InitCommonControlsEx() §ä§â§Ö§Ò§å§Ö§ä§ã§ñ §Õ§Ý§ñ Windows XP, §Ö§ã§Ý§Ú §Þ§Ñ§ß§Ú§æ§Ö§ã§ä
	// §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ §Ú§ã§á§à§Ý§î§Ù§å§Ö§ä ComCtl32.dll §Ó§Ö§â§ã§Ú§Ú 6 §Ú§Ý§Ú §Ò§à§Ý§Ö§Ö §á§à§Ù§Õ§ß§Ö§Û §Ó§Ö§â§ã§Ú§Ú §Õ§Ý§ñ §Ó§Ü§Ý§ð§é§Ö§ß§Ú§ñ
	// §ã§ä§Ú§Ý§Ö§Û §à§ä§à§Ò§â§Ñ§Ø§Ö§ß§Ú§ñ. §£ §á§â§à§ä§Ú§Ó§ß§à§Þ §ã§Ý§å§é§Ñ§Ö §Ò§å§Õ§Ö§ä §Ó§à§Ù§ß§Ú§Ü§Ñ§ä§î §ã§Ò§à§Û §á§â§Ú §ã§à§Ù§Õ§Ñ§ß§Ú§Ú §Ý§ð§Ò§à§Ô§à §à§Ü§ß§Ñ.
	INITCOMMONCONTROLSEX InitCtrls;
	InitCtrls.dwSize = sizeof(InitCtrls);
	// §£§í§Ò§Ö§â§Ú§ä§Ö §ï§ä§à§ä §á§Ñ§â§Ñ§Þ§Ö§ä§â §Õ§Ý§ñ §Ó§Ü§Ý§ð§é§Ö§ß§Ú§ñ §Ó§ã§Ö§ç §à§Ò§ë§Ú§ç §Ü§Ý§Ñ§ã§ã§à§Ó §å§á§â§Ñ§Ó§Ý§Ö§ß§Ú§ñ, §Ü§à§ä§à§â§í§Ö §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§à §Ú§ã§á§à§Ý§î§Ù§à§Ó§Ñ§ä§î
	// §Ó §Ó§Ñ§ê§Ö§Þ §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§Ú.
	InitCtrls.dwICC = ICC_WIN95_CLASSES;
	InitCommonControlsEx(&InitCtrls);

	CWinApp::InitInstance();


	AfxEnableControlContainer();

	// §³§à§Ù§Õ§Ñ§ä§î §Õ§Ú§ã§á§Ö§ä§é§Ö§â §à§Ò§à§Ý§à§é§Ü§Ú, §Ó §ã§Ý§å§é§Ñ§Ö, §Ö§ã§Ý§Ú §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ö §à§Ü§ß§à §ã§à§Õ§Ö§â§Ø§Ú§ä
	// §á§â§Ö§Õ§ã§ä§Ñ§Ó§Ý§Ö§ß§Ú§Ö §Õ§Ö§â§Ö§Ó§Ñ §à§Ò§à§Ý§à§é§Ü§Ú §Ú§Ý§Ú §Ü§Ñ§Ü§Ú§Ö-§Ý§Ú§Ò§à §Ö§Ô§à §ï§Ý§Ö§Þ§Ö§ß§ä§í §å§á§â§Ñ§Ó§Ý§Ö§ß§Ú§ñ.
	CShellManager *pShellManager = new CShellManager;

	// §³§ä§Ñ§ß§Õ§Ñ§â§ä§ß§Ñ§ñ §Ú§ß§Ú§è§Ú§Ñ§Ý§Ú§Ù§Ñ§è§Ú§ñ
	// §¦§ã§Ý§Ú §ï§ä§Ú §Ó§à§Ù§Þ§à§Ø§ß§à§ã§ä§Ú §ß§Ö §Ú§ã§á§à§Ý§î§Ù§å§ð§ä§ã§ñ §Ú §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§à §å§Þ§Ö§ß§î§ê§Ú§ä§î §â§Ñ§Ù§Þ§Ö§â
	// §Ü§à§ß§Ö§é§ß§à§Ô§à §Ú§ã§á§à§Ý§ß§ñ§Ö§Þ§à§Ô§à §æ§Ñ§Û§Ý§Ñ, §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§à §å§Õ§Ñ§Ý§Ú§ä§î §Ú§Ù §ã§Ý§Ö§Õ§å§ð§ë§Ú§ç
	// §Ü§à§ß§Ü§â§Ö§ä§ß§í§ç §á§â§à§è§Ö§Õ§å§â §Ú§ß§Ú§è§Ú§Ñ§Ý§Ú§Ù§Ñ§è§Ú§Ú, §Ü§à§ä§à§â§í§Ö §ß§Ö §ä§â§Ö§Ò§å§ð§ä§ã§ñ
	// §ª§Ù§Þ§Ö§ß§Ú§ä§Ö §â§Ñ§Ù§Õ§Ö§Ý §â§Ö§Ö§ã§ä§â§Ñ, §Ó §Ü§à§ä§à§â§à§Þ §ç§â§Ñ§ß§ñ§ä§ã§ñ §á§Ñ§â§Ñ§Þ§Ö§ä§â§í
	// TODO: §ã§Ý§Ö§Õ§å§Ö§ä §Ú§Ù§Þ§Ö§ß§Ú§ä§î §ï§ä§å §ã§ä§â§à§Ü§å §ß§Ñ §é§ä§à-§ß§Ú§Ò§å§Õ§î §á§à§Õ§ç§à§Õ§ñ§ë§Ö§Ö,
	// §ß§Ñ§á§â§Ú§Þ§Ö§â §ß§Ñ §ß§Ñ§Ù§Ó§Ñ§ß§Ú§Ö §à§â§Ô§Ñ§ß§Ú§Ù§Ñ§è§Ú§Ú
	SetRegistryKey(_T("§­§à§Ü§Ñ§Ý§î§ß§í§Ö §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ, §ã§à§Ù§Õ§Ñ§ß§ß§í§Ö §ã §á§à§Þ§à§ë§î§ð §Þ§Ñ§ã§ä§Ö§â§Ñ §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§Û"));

	CADODlg dlg;
	m_pMainWnd = &dlg;
	INT_PTR nResponse = dlg.DoModal();
	if (nResponse == IDOK)
	{
		// TODO: §£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Õ §Õ§Ý§ñ §à§Ò§â§Ñ§Ò§à§ä§Ü§Ú §Ù§Ñ§Ü§â§í§ä§Ú§ñ §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ô§à §à§Ü§ß§Ñ
		//  §ã §á§à§Þ§à§ë§î§ð §Ü§ß§à§á§Ü§Ú "§°§¬"
	}
	else if (nResponse == IDCANCEL)
	{
		// TODO: §£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Õ §Õ§Ý§ñ §à§Ò§â§Ñ§Ò§à§ä§Ü§Ú §Ù§Ñ§Ü§â§í§ä§Ú§ñ §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ô§à §à§Ü§ß§Ñ
		//  §ã §á§à§Þ§à§ë§î§ð §Ü§ß§à§á§Ü§Ú "§°§ä§Þ§Ö§ß§Ñ"
	}

	// §µ§Õ§Ñ§Ý§Ú§ä§î §Õ§Ú§ã§á§Ö§ä§é§Ö§â §à§Ò§à§Ý§à§é§Ü§Ú, §ã§à§Ù§Õ§Ñ§ß§ß§í§Û §Ó§í§ê§Ö.
	if (pShellManager != NULL)
	{
		delete pShellManager;
	}

	// §±§à§ã§Ü§à§Ý§î§Ü§å §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ö §à§Ü§ß§à §Ù§Ñ§Ü§â§í§ä§à, §Ó§à§Ù§Ó§â§Ñ§ä§Ú§ä§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö FALSE, §é§ä§à§Ò§í §Þ§à§Ø§ß§à §Ò§í§Ý§à §Ó§í§Û§ä§Ú §Ú§Ù
	//  §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ §Ó§Þ§Ö§ã§ä§à §Ù§Ñ§á§å§ã§Ü§Ñ §Ô§Ö§ß§Ö§â§Ñ§ä§à§â§Ñ §ã§à§à§Ò§ë§Ö§ß§Ú§Û §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ.
	return FALSE;
}

