#pragma once

// §£§Ü§Ý§ð§é§Ö§ß§Ú§Ö SDKDDKVer.h §à§Ò§Ö§ã§á§Ö§é§Ú§Ó§Ñ§Ö§ä §à§á§â§Ö§Õ§Ö§Ý§Ö§ß§Ú§Ö §ã§Ñ§Þ§à§Û §á§à§ã§Ý§Ö§Õ§ß§Ö§Û §Õ§à§ã§ä§å§á§ß§à§Û §á§Ý§Ñ§ä§æ§à§â§Þ§í Windows.

// §¦§ã§Ý§Ú §ä§â§Ö§Ò§å§Ö§ä§ã§ñ §Ó§í§á§à§Ý§ß§Ú§ä§î §á§à§ã§ä§â§à§Ö§ß§Ú§Ö §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ §Õ§Ý§ñ §á§â§Ö§Õ§í§Õ§å§ë§Ö§Û §Ó§Ö§â§ã§Ú§Ú Windows, §Ó§Ü§Ý§ð§é§Ú§ä§Ö WinSDKVer.h §Ú
// §Ù§Ñ§Õ§Ñ§Û§ä§Ö §Õ§Ý§ñ §Þ§Ñ§Ü§â§à§à§á§â§Ö§Õ§Ö§Ý§Ö§ß§Ú§ñ _WIN32_WINNT §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §á§à§Õ§Õ§Ö§â§Ø§Ú§Ó§Ñ§Ö§Þ§à§Û §á§Ý§Ñ§ä§æ§à§â§Þ§í §á§Ö§â§Ö§Õ §Ó§ç§à§Ø§Õ§Ö§ß§Ú§Ö§Þ SDKDDKVer.h.

#include <SDKDDKVer.h>
